# 2) Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#
# *Пример:*
#
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list01 = [2, 3, 4, 5, 6]

composition = []

for i in range((len(list01) + 1) // 2):
    composition.append(list01[i] * list01[len(list01) - 1 - i])

print(composition)